Tekla Open API Reference for Tekla Structures 2025
RebarItemEnumerator Properties
The RebarItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a rebar item instance of the current element.
Top
See Also
Reference
RebarItemEnumerator Class
Tekla.Structures.Catalogs Namespace